Dummy host must be perpendicular to Z or Y axis.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId DummyHostMustBePerpendicularToXY { get; }
  Visual Basic
Public Shared ReadOnly Property DummyHostMustBePerpendicularToXY As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ DummyHostMustBePerpendicularToXY {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures FamilyFailures Class
  Autodesk.Revit.DB Namespace